# RemoveLight Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightGroup..::..RemoveLight Method
LightGroup Class See Also
---
Remove the given light instance from the set of light instances in this group
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void RemoveLight(
	ElementId lightId
)
```

Visual Basic
---
```text
Public Sub RemoveLight ( _
	lightId As ElementId _
)
```

Visual C++
---
```text
public:
void RemoveLight(
	ElementId^ lightId
)
```

# ### Parameters
lightId
    Type: Autodesk.Revit.DB..::..ElementId The light instance to remove
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The light instance is not in this LightGroup |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace